<?php 

$books = array(
	"451° по Фаренгейту" => "Рэй Бредбери", 
	"Шантарам" => "Грегори Дэвид Робертс", 
	"1984" => "Джорж Оруэл", 
	"Мастер и Маргарита" => "Михаил Афанасьевич Булгаков", 
	"Три товарища" => "Эрих Мария Ремарк", 
	"Портрет Дориана Грея" => "Оскар Уайльд", 
	"Вино из одуванчиков" => "Рей Брэдбери", 
	"Над пропастью во ржи" => "Джером Д. Сэлинджер", 
	"Маленький принц" => "Антуан де Сент-Экзюпери", 
	"Анна Каренина" => "Лев Толстой",
	"Сто лет одиночества" => "Габриэль Гарсиа Маркес", 
	"Тень горы" => "Грегори Дэвид Робертс", 
	"Атлант расправил плечи" => "Айн Рэнд");

print_r($books);

echo "<ol>";
foreach ($books as $novel => $author) {
echo "<li><strong>$author</strong>: <em>$novel</em></li>";
}
echo "</ol>";

?>